#include <iostream>

using namespace std;
//C2
int main()
{
    setlocale(LC_ALL,"Russian");
    int n,nmax=12;
    //массив данных
    string mn[12]={"€нварь","февраль","март","апрель","май","июнь","июль","август","сент€брь","окт€брь","но€брь","декабрь"};
    //«апрос ввода
    cout << "номер мес€ца: ";cin >>n;
    //использован оператор:
    //<условие> ? <код выполн€емые если условие верно> : <код выполн€емый в остальных случа€х>
    ((n<=nmax)and(n>0))? cout << n << "--" << mn[n-1] << endl : cout <<"неправильный номер "<< endl;
    return 0;
}
